Carregue o banco de dados CardioGoodFitness anexo nesta aula;

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('CardioGoodFitness.csv')
df

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
0,TM195,18,Male,14,Single,3,4,29562,112
1,TM195,19,Male,15,Single,2,3,31836,75
2,TM195,19,Female,14,Partnered,4,3,30699,66
3,TM195,19,Male,12,Single,3,3,32973,85
4,TM195,20,Male,13,Partnered,4,2,35247,47
...,...,...,...,...,...,...,...,...,...
175,TM798,40,Male,21,Single,6,5,83416,200
176,TM798,42,Male,18,Single,5,4,89641,200
177,TM798,45,Male,16,Single,5,5,90886,160
178,TM798,47,Male,18,Partnered,4,5,104581,120
179,TM798,48,Male,18,Partnered,4,5,95508,180

Imprima o número de linhas e colunas do dataset;

In [8]:
df.shape

(180, 9)

Imprima as 3 primeiras linhas do DataFrame;

In [9]:
df.head(3)

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66

Imprima as 2 últimas linhas do DataFrame;

In [10]:
df.tail(2)

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
178,TM798,47,Male,18,Partnered,4,5,104581,120
179,TM798,48,Male,18,Partnered,4,5,95508,180

Imprima o tipo de dado de cada coluna;

In [13]:
df.dtypes

Product          object
Age               int64
Gender           object
Education         int64
MaritalStatus    object
Usage             int64
Fitness           int64
Income            int64
Miles             int64
dtype: object

Converta a coluna Income para float;

In [14]:
df['Income'] =  df['Income'].astype(float)

Imprima os valores únicos da coluna Product;

In [16]:
df['Product'].unique()

array(['TM195', 'TM498', 'TM798'], dtype=object)

Imprima os valores únicos da coluna MaritalStatus;

In [17]:
df['MaritalStatus'].unique()

array(['Single', 'Partnered'], dtype=object)

Imprima a proporção de homens e mulheres.

In [20]:
df['Gender'].value_counts()

Male      104
Female     76
Name: Gender, dtype: int64

Após as operaões realizadas no exercício 5, converta o banco de dados para o formato Json.

In [ ]:
df1 = df.to_json('CardioGoodFitness.json')